gh-pages/nvidia-docker/Install.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>nvidia-docker 설치하기</title>
<!-- 2018-09-18 Tue 07:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
</head>
<body>
<div id="content">
<h1 class="title">nvidia-docker 설치하기</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 요구사항</a></li>
<li><a href="#sec-2">2. 버전에 맞는 Docker 설치 방법</a>
<ul>
<li><a href="#sec-2-1">2.1. 기존 Docker 제거</a></li>
<li><a href="#sec-2-2">2.2. 버전에 맞는 Docker 설치(18.03.1 버전 기준)</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Ubuntu 16.04</a></li>
<li><a href="#sec-2-2-2">2.2.2. Ubuntu 18.04</a></li>
<li><a href="#sec-2-2-3">2.2.3. 설치</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. nvidia-docker 설치</a></li>
<li><a href="#sec-2-4">2.4. 설치 확인</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 참조</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 요구사항</h2>
<div class="outline-text-2" id="text-1">
<p>
nvidia-docker를 설치하기 위해서 최신 docker stable 버전을 유지해야 한다.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 버전에 맞는 Docker 설치 방법</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 기존 Docker 제거</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh">$ dpkg -l | grep -i docker # 기존 Docker 설치 확인
$ sudo apt-get purge -y docker-ce # Docker 제거
$ sudo apt-get autoremove -y --purge docker-ce
$ sudo apt-get autoclean
$ sudo rm -rf /var/lib/docker
$ sudo rm /etc/apparmor.d/docker
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 버전에 맞는 Docker 설치(18.03.1 버전 기준)</h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Ubuntu 16.04</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt-get install apt-transport-https ca-certificates curl software-properties-common
$ curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
$ sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/ubuntu xenial stable"
$ sudo apt-get update
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Ubuntu 18.04</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-sh">$ sudo apt install apt-transport-https ca-certificates curl software-properties-common
$ curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo apt-key add -
$ sudo add-apt-repository "deb [arch=amd64] https://download.docker.com/linux/ubuntu bionic test"
$ sudo apt update
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> 설치</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">

<pre class="src src-sh">sudo apt-get install docker-ce=18.03.1~ce-0~ubuntu
</pre>
</div>
<p>
(Ubuntu 18.04에서 해당 버전을 못찾을 경우, Ubuntu 16.04 과정으로 진행하면 됩니다.)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> nvidia-docker 설치</h3>
<div class="outline-text-3" id="text-2-3">
<p>
반드시 docker를 최신 stable 버전으로 유지해야 설치가 가능합니다.
</p>
<div class="org-src-container">

<pre class="src src-sh">$ curl -s -L https://nvidia.github.io/nvidia-docker/gpgkey | \
  sudo apt-key add -
$ curl -s -L https://nvidia.github.io/nvidia-docker/ubuntu16.04/amd64/nvidia-docker.list | \
  sudo tee /etc/apt/sources.list.d/nvidia-docker.list
$ sudo apt-get update
$ sudo apt-get install -y nvidia-docker2
$ sudo service docker restart
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 설치 확인</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-sh">sudo nvidia-docker pull nvidia/cuda nvidia-smi
sudo nvidia-docker run --rm nvidia/cuda nvidia-smi
</pre>
</div>

<pre class="example">
+-----------------------------------------------------------------------------+
| NVIDIA-SMI 390.48                 Driver Version: 390.48                    |
|-------------------------------+----------------------+----------------------+
| GPU  Name        Persistence-M| Bus-Id        Disp.A | Volatile Uncorr. ECC |
| Fan  Temp  Perf  Pwr:Usage/Cap|         Memory-Usage | GPU-Util  Compute M. |
|===============================+======================+======================|
|   0  GeForce GTX 750 Ti  Off  | 00000000:05:00.0  On |                  N/A |
| 34%   29C    P8     1W /  38W |    252MiB /  2000MiB |      1%      Default |
+-------------------------------+----------------------+----------------------+

+-----------------------------------------------------------------------------+
| Processes:                                                       GPU Memory |
|  GPU       PID   Type   Process name                             Usage      |
|=============================================================================|
+-----------------------------------------------------------------------------+
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 참조</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/44760648/how-to-remove-docker-completely-from-ubuntu-14-04">Docker 삭제</a>
</li>
<li><a href="https://unix.stackexchange.com/questions/363048/unable-to-locate-package-docker-ce-on-a-64bit-ubuntu">Docker 설치</a>
</li>
<li><a href="http://www.kwangsiklee.com/ko/2018/02/%EC%A0%95%EB%A6%AC-ubuntu%EC%84%9C%EB%B2%84%EC%97%90-nvidia-docker-%EC%84%A4%EC%B9%98-%ED%95%98%EA%B8%B0/">nvidia-docker 설치하기</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2018-09-18 Tue 07:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
